app/controllers/coauthors_controller.rb

SELECT * FROM "lemmas" WHERE ("lemmas"."id" = 5)
---
  def load_coauthor
    @lemma = Lemma.find(params[:lemma_id])