app/controllers/lemmas_controller.rb

  def index
    @lemmas = Lemma.all
---
SELECT * FROM "lemmas"

  def create
    @lemma = Lemma.new params[:lemma]
    if @lemma.save
      #为词条的创建者添加积分。
      coauthor =  Coauthor.create!(:lemma => @lemma,:user => current_user,:activion => true)
---
INSERT INTO "lemmas" ("updated_at", "title", "body", "cache_tag_list", "point", "created_at") VALUES('2010-05-03 03:00:02', '牛C哥', 'For this blog I needed to have some kind of plug-in to integrate tags and add them to my blog posts. For this I used the acts_as_taggable_on_steroids plug-in, which is great when you need an easy way to use tags and build your own tag cloud. This tutorial will show you how to use the tags and the cloud in your rails application. You can have the same explanation in the README file in the plug-in, but I found some items a bit confusing, so I rewrote the tutorial! But first things first, run the following command in the command line to install the plug-in.', NULL, 5, '2010-05-03 03:00:02')
INSERT INTO "coauthors" ("updated_at", "lemma_id", "user_id", "activion", "created_at") VALUES('2010-04-30 09:56:40', 1, 1, 't', '2010-04-30 09:56:40')

  def update
    if @lemma.update_attributes(params[:lemma])
      coauthor = Coauthor.find_by_user_id_and_lemma_id current_user.id,@lemma.id
---
UPDATE "lemmas" SET "body" = '想当年贫尼看《射雕英雄传》时，很烦丘处机。此人像是得了歇斯底里症，吵死了。尤其是给郭、杨两家小孩儿起名字那一段，看得我差点笑死——丘道长你光想着“靖康之耻”，就让人家小孩儿名叫“靖”！那亏得丘道长您有幸遇到的是郭啸天啊，你丫要是遇到殷天正可怎么办？
SELECT * FROM "coauthors" WHERE ("coauthors"."user_id" = 2 AND "coauthors"."lemma_id" = 1) LIMIT 1

  def destroy
    @lemma.destroy
---
DELETE FROM "lemmas" WHERE "id" = 1

  def load_lemma
    @lemma = Lemma.find(params[:id])
---
SELECT * FROM "lemmas" WHERE ("lemmas"."id" = 1)