app/controllers/tag_controller.rb

SELECT tags.id, tags.name, COUNT(*) AS count FROM "tags" INNER JOIN taggings ON tags.id = taggings.tag_id INNER JOIN lemmas ON lemmas.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Lemma') GROUP BY tags.id, tags.name HAVING COUNT(*) > 0
---
  def index
    @page_title = 'Listing tags'
    @tags = Lemma.tag_counts
    @tags =Tag.paginate :page=>params[:page],
                                  :order => :name,
                                  :per_page => 10