app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def index
   @users = User.find(:all)

INSERT INTO "users" ("name", "salt", "updated_at", "crypted_password", "remember_token_expires_at", "role", "point", "remember_token", "login", "email", "created_at") VALUES('', 'a4cc4de960da602d73258b43d109e7498d60eac4', '2010-04-30 09:58:15', '830cb93744872505920ee3409dec11130543e03b', NULL, 'Wikier', 0, NULL, 'rockyman', 'yangxiwen@gmail.com', '2010-04-30 09:58:15')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save

UPDATE "users" SET "role" = 'providence_breaker', "updated_at" = '2010-04-30 04:04:11' WHERE "id" = 1
---
  def update
   if @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
---
 def load_user
  @user = User.find(params[:id])